{
    "presentacion":[
        {
        "title":"Buscas programador? Contactame!",

        "body": "<p> Soy Esteban Kroh, programador web de Santa Rosa, La Pampa. Informático por vocación y emprendedor por naturaleza, contáctame para completar tus proyectos! </p><p>Como programador web apasionado por mi trabajo, mi objetivo es ayudar a tu empresa a destacar en el mundo digital. Con amplios conocimientos en diferentes tecnologías y una sólida base en la lógica de programación, puedo ofrecerte soluciones personalizadas que se adapten a tus necesidades y a las de tus clientes. </p><p>Con mi enfoque en la calidad y la satisfacción del usuario final, trabajo con las últimas tecnologías para crear aplicaciones web modernas y atractivas. Si necesitas una página web desde cero, una actualización de la existente o una integración de sistemas, estaré encantado de discutir tus objetivos y llevarlos a cabo de manera eficiente. </p><p>Mi hobbie es patinar, así como me enamoré de la programación también me enamoré de los rollers y doy clases de rollers en Urban Rollers La Pampa hace ya varios años. Además, mi experiencia como profe de rollers me ha enseñado la importancia de la paciencia, la perseverancia y la creatividad en cada proyecto. Si estás buscando un programador web comprometido y entusiasta para tu equipo, ¡no dudes en contactarme! </p></br>",
        
        "frase":"El objetivo de contratar buenos profesionales es poder tener la tranquilidad que van a hacer el trabajo como si fueran dueños de la empresa.",
        
        "button1":"¿Sos emprendedor y querés una página para tu negocio?</br>Acá tenés info!",
        "button2":"¿Sos parte de una empresa y buscás colaboradores?</br>Acá tenés info sobre mis aptitudes!"
    
        }
        
    ],

    "aptitudes":[
        {
            "texto":"<p>Como programador web, cuento con una amplia variedad de habilidades y conocimientos que me permiten llevar a cabo proyectos innovadores y de calidad. En mi trayectoria, he desarrollado aplicaciones web en diferentes lenguajes de programación, tales como JavaScript, HTML, CSS, y he trabajado con frameworks como React y Node.js.</p><p>Mi experiencia no solo se limita al desarrollo web, sino también a la integración con distintas plataformas, bases de datos y sistemas de pago.</p><p>Para ver algunos de mis trabajos y proyectos personales, puedes visitar mi perfil en GitHub en el siguiente enlace: <a style='color: #b85b22' href='https://github.com/KrohEsteban' target='_blank' rel='noopener noreferrer'>https://github.com/KrohEsteban.</a></p><p>Si estás en busca de un programador web comprometido y apasionado por su trabajo, no dudes en contactarme. Estoy siempre dispuesto a colaborar en nuevos proyectos y desafíos.</p>"
        }
    ],

    "tecnologias":[

        {
        "stack": "HTML5 - CSS3 - Bootstrap - Javascript",
        "progress": "80"
        },
        
        {
        "stack": "React - Gatsby - Next",
        "progress": "75"
        },
                
        {
        "stack": "Wordpress - Strapi - Payload",
        "progress": "70"
        },

        {
        "stack": "Firebase - MongoDb",
        "progress": "40"
        },

        {
        "stack": "Node - Express  - Docker",
        "progress": "25"
        }
    ],

    "rollercarrousel":[

        {
        "titulo": "Pasión",
        "parrafo":"La pasión mueve montañas.",
        "imagen": "../images/roller-1.webp"
        },
        
        {
        "titulo": "Compromiso",
        "parrafo":"El compromiso hace al crecimiento.",
        "imagen": "../images/roller-2.webp"
        },
        
        {
        "titulo": "Trascendecia",
        "parrafo":"El futuro lo creamos nosotros.",
        "imagen": "../images/roller-3.webp"
        }
        
    ],
    "rollertext":[
        {
            "title":"Profe / Organizador / Dirigente",
            "body":"<p>Los rollers son mi segunda pasión y gracias a este emprendimiento puedo lograr que crezca el deporte. </p><p> Empecé creando un grupo llamado Uruban Rollers donde daba clases de rollers para niños y adultos. </p><p> En un principio comenzamos en la cancha de basquet de la laguna Don Tomas en Santa Rosa, La Pampa. Un lugar icónico para los rolleros de la ciudad ya que es uno de los pocos donde podemos practicar gracias al piso y las dimensiones. Pero pronto el espacio no nos alcanzó. </p><p> Dentro del mundo del patinaje en linea hay varias disciplinas, entre ellas encontramos Freestyle Slalom y Roller Hockey. El primero lo podemos practicar al aire libre, y es un deporte individual donde cada uno tiene que mejorar y aprender trucos nuevos, el segundo es un deporte en equipo, parecido al hockey sobre hielo pero sin tanto contacto. </p><p> Inicialmente, las clases fueron enfocadas en slalom, pero con el tiempo fuimos creando un equipo de hockey y terminamos agregando esta disciplina. Actualmente, tenemos equipos de roller hockey de menores y mayores, y brindamos clases de slalom para aquellos que quieran iniciar en el deporte. </p><p> El hecho de crear un equipo de roller hockey nos planteó varios inconvenientes: por un lado adquirir el equipamiento para que pueda comenzar cualquier persona sin importar si no tiene lo básico y por otro lado encontrar un espacio apto para poder practicar. </p><p> Probamos varios salones y varios clubes con los pocos horarios que nos brindaban. Creamos primero el equipo de mayores ya que los horarios que teníamos disponibles eran a partir de las 21hs, y con mucha perseverancia y esfuerzo pudimos conseguir un espacio con un horario más temprano para poder armar el equipo de roller hockey de menores. </p><p> También nos pusimos en contacto con la Federación Pampeana de Patín para crear el comité de roller hockey, del cual soy presidente y a través del mismo creamos la primera liga pampeana de roller hockey. </p><p> Hace ya 10 años que soy rollero y 4 años que creé Urban Roller, no me imaginé todo lo que podía lograr, pero éste es recién el principio...</p>"
        }
    ],
    "project":[

        {
        "titulo": "Clés en main",
        "fecha": "02/2023 - 03/2023",
        "parrafo":"Actualización de página, sumandole un nuevo idioma",
        "texto":"Me contrató la empresa <a style=color:#b85b22 target='_blank' rel='noopener noreferrer' href=https://cocoa.group/>Cocoa Group</a> para este proyecto en particular ya qué tengo conocimientos de strapi por otros proyectos. La empresa adquirió un trabajo temporal para sumarle el idioma inglés a la página que ya se encontraba en francés. Me pasaron las traducciones y el acceso al servidor con el que podía descargar todo y hacer una copia en local para trabajar y luego subir el proyecto completado. </br> El primer inconveniente surgió al descubrir que todo se encontraba en contendores docker. Esto no hizo más que demorar una semana el proyecto y sumarme otro stack a mi curriculum. Descargue todos los contenedores, los levante en local, sume las traducciones al strapi, descargué los archivos del frontend que se encontraban dentro de un contenedor docker, los modifique y cree las nuevas páginas para mostrar las nuevas traducciones, volví a compilar el contenedor y subí el sitio para que esté online nuevamente.",
        "slug":"/clesenmine",
        "urlexterna":"https://clesenmain.com",
        "stack":"Docker - Strapi - Nextjs",
        "imagen": "../images/clesenmine.webp",
        "imagencel": "../images/clesenmine-celu.webp"
        },

        {
        "titulo": "Segundo porfolio",
        "fecha": "10/2022 - 02/2023",
        "parrafo":"Actualización del porfolio para poder mostrar las nuevas habilidades adquiridas de forma más ordenada.",
        "texto":"Luego de crear la página para la liga de veteranos, decidí actualizar mi porfolio con las nuevas tecnologías que he aprendido. </br> Antes solo estaba creado con html, css y js, pero quería llevarlo para el lado de los framework de react. Y como en mi anterior proyecto trabaje con nextjs, cree este nuevo porfolio con gatsbyjs para aprender un nuevo framework y sumar otro stack a mi currículum.",
        "slug":"/segundoporfolio",
        "urlexterna":"https://www.estebankroh.com",
        "stack":"Gatsby",
        "imagen": "../images/segundo-porfolio.webp",
        "imagencel": "../images/segundo-porfolio-celu.webp"
        },

        {
        "titulo": "Liga de veteranos",
        "fecha": "02/2022 - 02/2023",
        "parrafo":"Pagina para la liga de veteranos de La Pampa para poder publicar los resultados desde un sistema de administración.",
        "texto":"La liga de veteranos fue mi primer proyecto real y con el que he crecido muchísimo. </br> En un principio lo comencé con react y firebase, esto me ayudo a afianzarme en estas dos tecnologías, pero a su vez me llevo más tiempo de lo pensado. Por ello, después de un tiempo, cambié el backend a strapi para avanzar más rápido poder terminar el proyecto completo. Luego de tener el proyecto online decidí cambiar nuevamente el backend, ya que strapi consume muchos recursos y por consiguiente el hosting es más caro. Por lo tanto, cree nuevamente todo el proyecto completo con nextjs y mongodb como base de datos. </br> Este fue uno de mis proyectos más grandes y me llevo a aprender mucho y a prepararme para todo lo que se viene.",
        "slug":"/ligaveteranos",
        "urlexterna":"https://ligaveteranos.onrender.com",
        "stack":"Next - MongoDB",
        "imagen": "../images/liga-veteranos.webp",
        "imagencel": "../images/liga-veteranos-celu.webp"
        },

        {
        "titulo": "Primer porfolio",
        "fecha": "01/2022 - 02/2022",
        "parrafo":"Mi primer porfolio, creado para demostrar mis conocimientos web de manera mas explicita.",
        "texto":"Luego de un tiempo de venir aprendiendo programación web de forma autodidáctica, me di cuenta de que ya estaba preparado para poder trabajar y aportar lo mío a proyectos reales. </br> Por ello cree este porfolio, con el objetivo de mostrar lo que he aprendido y demostrar lo que puedo lograr.",
        "slug":"/primerporfolio",
        "urlexterna":"https://estebankrohprimerporfolio.onrender.com",
        "stack":"HTML - CSS - Javascript",
        "imagen": "../images/primer-porfolio.webp",
        "imagencel": "../images/primer-porfolio-celu.webp"
        },

        {
        "titulo": "Blog de café",
        "fecha": "11/2021 - 12/2021",
        "parrafo":"Otro de mis primeros proyectos creados como practica. Simula una blog de café con cursos.",
        "texto":"Una de mis primeras prácticas. La realicé en un curso de diseño web en la UTN y este es uno de sus primeros proyectos. El curso era básico, comenzamos con html, css y js, luego pasamos a react y por último algo de node. </br> Lo dejé a mitad de camino, ya que teníamos clases una vez por semana y era mucho más lo que aprendía como autodidacta que lo que me enseñaban en el mismo.",
        "slug":"/blogcafe",
        "urlexterna":"https://blogcafe.onrender.com",
        "stack":"HTML - CSS - Javascript",
        "imagen": "../images/blog-cafe.webp",
        "imagencel": "../images/blog-cafe-celu.webp"
        },

        {
        "titulo": "Tienda de muebles",
        "fecha": "09/2021 - 10/2021",
        "parrafo":"Uno de mis primeros proyectos creados como practica. Simula una tienda de muebles",
        "texto":"Una de mis primeras prácticas. La realicé en un curso de diseño web en la UTN y este es uno de sus primeros proyectos. El curso era básico, comenzamos con html, css y js, luego pasamos a react y por último algo de node. </br> Lo dejé a mitad de camino, ya que teníamos clases una vez por semana y era mucho más lo que aprendía como autodidacta que lo que me enseñaban en el mismo.",
        "slug":"/tiendamuebles",
        "urlexterna":"https://tiendademuebles.onrender.com",
        "stack":"HTML - CSS",
        "imagen": "../images/tienda-muebles.webp",
        "imagencel": "../images/tienda-muebles-celu.webp"
        }

    ]
    
}